task1 = [[[1,2,3,4,5,6,7,8,9,10],[11,12,13,14,15,16,17,18,19,20]],[[21,22,23,24,25,26,27,28,29,30],[31,32,33,34,35,36,37,38,39,40]],[[41,42,43,44,45,45],[46,[47,48],49,50], [51,52,53,54,55], [56,57,58,59,60]],[61,62,63,[64,65,66,67,68,69,70,71],72,73,74,[75, [76,77,78],79],80],[81,82,83,84,85,86]]
print(task1[3][7][1][2])

#task2 = input()
task2 = "Иван Иванович Иванов"
task2 = task2.split(' ')
print(task2[2], task2[0], task2[1])


task3 = []
while True:
    inp = input()
    if inp in task3:
        continue
    if inp == "0":
        break
    task3.append(inp)


m2, m1 = -99999, -99999

for x in task3:
    if int(x) > int(m2):
        if int(x) > int(m1):
            m2, m1 = m1, x
        else:
            m2 = x


else:
    print(m2)